# Data Loading, Storage, and File Formats

In [1]:
import numpy as np
import pandas as pd

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('examples/ex1.csv', sep=',')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'], index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [8]:
pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

### JSON Data

In [9]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [10]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)

1

In [12]:
tables[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [13]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [14]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [15]:
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [16]:
import requests

In [17]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [18]:
data = resp.json()

In [19]:
data[0]['title']

'CLN: more blocks code out from try/excepts'

In [20]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,27200,CLN: more blocks code out from try/excepts,[],open
1,27199,DEPR: make Categorical.ravel() return Categorical,[],open
2,27198,DEPR: Deprecate outer ufunc in Series.__array_...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
3,27197,BUG: Dataframe fill_na with series,[],open
4,27195,WIP: Remove conda warning,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
5,27194,REGR: Group empty Series,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
6,27193,CLN: fix cython build warning,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
7,27192,improve test for timestamp addition/subtraction,[],open
8,27191,DOC: Started 0.25.1 whatsnew,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
9,27190,REGR: Series.groupby([]) raises,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
10,27189,REGR: np.i0(Series) failing with IndexError on...,[],open
11,27188,DOC: whatsnew for array_ufunc,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
12,27187,CLN: simplify MultiIndex._shallow_copy,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
13,27186,REGR: Series.__array_ufunc__ doesn't handle `....,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
14,27185,DataFrame.sum() with mix of timedelta and Inte...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
15,27184,Object dtype for empty describe,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
16,27183,DataFrame.describe for all-empty should be obj...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
17,27182,Adding offset to Timestamp discards freq infor...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
18,27181,Code for list of partial indexers should be in...,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
19,27180,Partial date indexing only works with single key,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
20,27179,CI: Format isort output to be detected as Azur...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
21,27178,DOC: Parameters name and fastpath of Series ar...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
22,27177,dataframe to_sql is inserting raw text into or...,[],open
23,27174,CLN: Collapse private ._take implementation in...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
24,27170,CLN: remove fastparquet compat shim,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
25,27169,Build warnings in template for intervaltree.pxi,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
26,27167,"CLN/INT: avoid getattr(obj, 'values', obj) idiom","[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
27,27166,Removed block context from objToJSON,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
28,27165,CLN/INT: remove usage of _internal_get_values,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
29,27164,INT: the json C code should not deal with blocks,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open

### Interacting with Databases

In [21]:
import sqlite3

In [22]:
query = """
create table test(
    a varchar(20),
    b varchar(20),
    c real,
    d int
);
"""

con = sqlite3.connect('mydata.sqlite')

In [23]:
con.execute(query)

In [24]:
con.commit()

In [25]:
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]
stmt = 'insert into test values (?, ?, ?, ?)'
con.executemany(stmt, data)
con.commit()

In [26]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]